Extensions/ЮЦАУ/Reports/КассоваяКнига.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>КассоваяКнига</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПлатежныйАгент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СформироватьОбложку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыводитьОснования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоследнийЛист</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Extensions/ЮЦАУ/Reports/КассоваяКнига/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиентеНаСервереБезКонтекста
&Вместо("ИзменениеРеквизитаШапкиОтчета")
Процедура Расш1_ИзменениеРеквизитаШапкиОтчета(Форма)
	
	Отчет = Форма.Отчет;
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("НачалоПериода",            Отчет.НачалоПериода);
	ПараметрыОтчета.Вставить("КонецПериода",             Отчет.КонецПериода);
	ПараметрыОтчета.Вставить("Организация",              Отчет.Организация);
	ПараметрыОтчета.Вставить("ПодразделениеОрганизации", Отчет.ПодразделениеОрганизации);
	ПараметрыОтчета.Вставить("ПлатежныйАгент",           Отчет.ПлатежныйАгент);
	ПараметрыОтчета.Вставить("ПассажирскиеПеревозки",    Форма.ПассажирскиеПеревозки);
	
	ДопПараметры = ПолучитьДополнительныеПараметры(ПараметрыОтчета);
	ЗаполнитьЗначенияСвойств(Форма, ДопПараметры, "Кассир, ГлавныйБухгалтер, НомерЛистаНачало");
	
	ОбновитьТекстЗаголовка(Форма);
	
КонецПроцедуры

//&НаКлиенте
//&Перед("КнигаФормируетсяПриИзменении")
//Процедура Расш1_КнигаФормируетсяПриИзменении(Элемент)
//	
//	Отчет.ПлатежныйАгент = НЕ КнигаФормируется;
//	ИзменениеРеквизитаШапкиОтчета(ЭтотОбъект);
//	
//	Если НЕ ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
//		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
//	КонецЕсли;
//	
//КонецПроцедуры
